IDENTIFICATION DIVISION.
  PROGRAM-ID. READ_FILE.  **Descriptive program name**

ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
      SELECT INPUT-FILE ASSIGN TO "input.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
  FILE SECTION.
    FD INPUT-FILE.
      01 RECORD-IN PIC X(80).  **Descriptive variable name**

  WORKING-STORAGE SECTION.
    01 EOF-FLAG PIC X VALUE 'N'.  **Descriptive variable name**
    01 READ-DATA PIC X(80).  **Descriptive variable name**

PROCEDURE DIVISION.
  000-MAINLINE.
    OPEN INPUT INPUT-FILE
      GOTO 000-READ-LOOP.

  000-READ-LOOP.
    IF EOF-FLAG = 'Y'
      THEN GOTO 000-END-PROGRAM
      ELSE GOTO 000-READ-RECORD
    END-IF.

  000-READ-RECORD.
    READ INPUT-FILE INTO READ-DATA
      AT END
        MOVE 'Y' TO EOF-FLAG
        GOTO 000-READ-LOOP
      NOT AT END
        DISPLAY READ-DATA
        GOTO 000-READ-LOOP
    END-READ.

  000-END-PROGRAM.
    CLOSE INPUT-FILE
    STOP RUN.
