IDENTIFICATION DIVISION.
PROGRAM-ID. Controller.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MODEL-NAME      PIC X(50).
01 MODEL-VALUE     PIC 9(5).

PROCEDURE DIVISION.

MAIN-LOGIC SECTION.

    CALL 'Model' USING MODEL-NAME MODEL-VALUE.
    MOVE "Initial Name" TO MODEL-NAME.
    MOVE 100 TO MODEL-VALUE.
    CALL 'Model' USING MODEL-NAME MODEL-VALUE.
    
    CALL 'Model' USING MODEL-NAME MODEL-VALUE.
    CALL 'View' USING MODEL-NAME MODEL-VALUE.

    STOP RUN.
