IDENTIFICATION DIVISION.
PROGRAM-ID. Model.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MODEL-NAME      PIC X(50).
01 MODEL-VALUE     PIC 9(5).

LINKAGE SECTION.
01 NAME-PARAM      PIC X(50).
01 VALUE-PARAM     PIC 9(5).

PROCEDURE DIVISION USING NAME-PARAM VALUE-PARAM.

SET-NAME SECTION.
    MOVE NAME-PARAM TO MODEL-NAME.
    EXIT.

GET-NAME SECTION.
    MOVE MODEL-NAME TO NAME-PARAM.
    EXIT.

SET-VALUE SECTION.
    MOVE VALUE-PARAM TO MODEL-VALUE.
    EXIT.

GET-VALUE SECTION.
    MOVE MODEL-VALUE TO VALUE-PARAM.
    EXIT.

STOP RUN.
