IDENTIFICATION DIVISION.
PROGRAM-ID. View.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 VIEW-NAME      PIC X(50).
01 VIEW-VALUE     PIC 9(5).

LINKAGE SECTION.
01 NAME-PARAM      PIC X(50).
01 VALUE-PARAM     PIC 9(5).

PROCEDURE DIVISION USING NAME-PARAM VALUE-PPARAM.

PRINT-DETAILS SECTION.
    MOVE NAME-PARAM TO VIEW-NAME.
    MOVE VALUE-PARAM TO VIEW-VALUE.
    DISPLAY "Name: " VIEW-NAME.
    DISPLAY "Value: " VIEW-VALUE.
    EXIT.

STOP RUN.
